In [38]:
import random
import string
import pandas as pd

In [112]:
tid = set()
Units = []
Dollars=[]
tid_1 =set()
Units_1 = []
Dollars_1=[]
for i in range(50):
    tid.add(''.join(random.choices('ABCD' + '123', k=3)))
    Units.append(random.randint(10,30))
    Dollars.append(random.randint(10,30))
    tid_1.add(''.join(random.choices('ABCD' + '123', k=3)))
    Units_1.append(random.randint(10,30))
    Dollars_1.append(random.randint(10,30))
minm = min(len(tid),len(tid_1),len(Units),len(Units_1),len(Dollars),len(Dollars_1))
tid=list(tid)[:minm]
tid_1 = list(tid_1)[:minm]
Units = Units[:minm]
Units_1 = Units_1[:minm]
Dollars = Dollars[:minm]
Dollars_1 = Dollars_1[:minm]

In [113]:
df1 = pd.DataFrame()
df2 = pd.DataFrame()

In [114]:
df1['T_id'] = tid
df1['Units'] = Units
df1['Dollars'] = Dollars

df2['T_id'] = tid_1
df2['Units'] = Units_1
df2['Dollars'] = Dollars_1

In [115]:
a = set(df1['T_id'])
b = set(df2['T_id'])

In [129]:
df1.to_csv('exam3_1.csv')
df2.to_csv('exam3_2.csv')

In [120]:
a.intersection(b)

{'2B3', '3B1', 'A21', 'C2D'}

In [121]:
b = set(df2['T_id'])

In [127]:
df1[df1['T_id']=='3B1']

   T_id  Units  Dollars
36  3B1     30       22

In [128]:
df2[df2['T_id']=='3B1']

   T_id  Units  Dollars
35  3B1     26       19

In [63]:
len(tid_1)

44

In [64]:
len(tid)

46

In [65]:
tid.intersection(tid_1)

{'2CB', '313', '32B', 'A2B', 'AC1', 'BAA', 'BBA'}

In [74]:
random.randint(10,30)

16

In [69]:
df = pd.DataFrame()

In [70]:
df['T_id'] = list(tid_1)

In [71]:
df.to_csv('exam3_2.csv')

In [20]:
''.join(random.choices(string.ascii_uppercase, k=3))

'WRJ'

In [37]:
''.join(random.choices('ABC' + '123', k=5))

'11C31'

In [6]:
string.ascii_letters

'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'

In [9]:
random.choice((string.ascii_letters))

TypeError: choice() takes 2 positional arguments but 3 were given

In [172]:
import pandas as pd

In [173]:
exam3_1 = pd.read_csv('exam3_1.csv')
exam3_2 = pd.read_csv('exam3_2.csv')

In [198]:
exam3_1

   T_id  Units  Dollars
0   CBC     30       13
1   1BA     25       20
2   1CA     21       13
3   22C     17       16
4   211     12       27
5   CCA     18       16
6   D2A     15       10
7   CDA     24       24
8   CAC     13       16
9   BD3     25       10
10  B33     30       13
11  A3C     30       10
12  DC2     21       27
13  C21     23       11
14  21D     26       29
15  122     11       19
16  1CB     27       16
17  AB2     22       27
18  CA2     20       27
19  C33     28       20
20  A3A     28       11
21  DD2     10       24
22  D23     28       18
23  3DB     12       29
24  AAC     17       13
25  2B3     12       30
26  1BC     25       22
27  DBB     24       24
28  C2D     10       17
29  2D2     27       16
30  A21     14       21
31  3AD     11       18
32  DA1     11       18
33  D2B     12       27
34  323     11       29
35  111     21       11
36  3B1     30       22
37  3C1     17       15
38  221     24       23
39  112     20       16
40  23C     22       11
41  2C3     20       21
42  BD2     16       30
43  1B2     24       11
44  D21     28       27

In [174]:
exam3_1.drop(columns=['Unnamed: 0'],inplace=True)
exam3_2.drop(columns=['Unnamed: 0'],inplace=True)

In [175]:
# merge both the dataframe based on T_id
# It is not mentioned in question ,whether to keep the remaining column of other files or not
# Hence,as a general practice,considering all columns of both the file (after matching with T_id)
exam3_3 = pd.merge(exam3_1, exam3_2, how='inner', on=['T_id'])

In [176]:
exam3_3

  T_id  Units_x  Dollars_x  Units_y  Dollars_y
0  2B3       12         30       14         12
1  C2D       10         17       11         12
2  A21       14         21       22         19
3  3B1       30         22       26         19

# a) number of transaction present in both exam2_1.csv and exam3_2.csv

In [177]:
len(exam3_3)

4

# b)

In [178]:
exam3_3

  T_id  Units_x  Dollars_x  Units_y  Dollars_y
0  2B3       12         30       14         12
1  C2D       10         17       11         12
2  A21       14         21       22         19
3  3B1       30         22       26         19

In [179]:
exam3_3.max(0) # find the max value column wise

T_id         C2D
Units_x       30
Dollars_x     30
Units_y       26
Dollars_y     19
dtype: object

In [180]:

max_unit = 30 # max(Units_x,Units_y) from above table
max_dollar = 30  # max(Dollars_x,Dollars_y) from above table       

# or you can do like below

# max_unit = max(exam3_3.max(0)['Units_x'],exam3_3.max(0)['Units_y'])
# max_dollar = max(exam3_3.max(0)['Dollars_x'],exam3_3.max(0)['Dollars_y'])   


# no of transaction where units and dollars have max value
Trx_no_units = len(exam3_3[exam3_3['Units_x']==max_unit])+len(exam3_3[exam3_3['Units_y']==max_unit])
Trx_no_dollars=len(exam3_3[exam3_3['Dollars_x']==max_dollar])+len(exam3_3[exam3_3['Dollars_y']==max_dollar])

In [181]:
print('no of transaction where units have max value: ',Trx_no_units)
print('no of transaction where dollars have max value: ',Trx_no_dollars)

no of transaction where units have max value:  1
no of transaction where dollars have max value:  1